Repository: collective/uwosh.pfg.d2c
Catalog: uwosh/pfg/d2c/locales/*/LC_MESSAGES/uwosh.pfg.d2c.po
Languages: de, es, it

source: A PloneFormGen adapter that will save the data from a form to an actual content type. This way you can still use permissions, workflows, etc on the form data.
de: Ein PloneFormGen Adapter der die Daten aus einem Formular in einen echten Artikeltyp speichert. Hierdurch können Zugriffsrechte, Arbeitsabläufe usw. mit jedem Formulareintrag verwendet werden.
es: Un adaptador para el producto PloneFormGen que guarda los datos desde un formulario en un real tipo de contenido. De esta manera. usted una sera posible de usar los permisos, flujo de trabajos, etc en el formulario de datos.
it: Un adattatore per PloneFormGen che salva i dati del form su un contenuto reale. In questo modo è ancora possibile usare i permessi, worfklow, etc sui dati.

source: A form action adapter that will save form input data to a content type.
es: Un adaptador de acción de formulario que guardara la data ingresada en un formulario en tipos de contenidos.
it: Un adattatore che salverà i dati del form in un contenuto

source: Add New Type
de: Neuen Artikeltyp hinzufügen
es: Agregar nuevo tipo
it: Aggiunti nuovo tipo

source: An entry for the content data adapter.
de: Ein Eintrag für den Dateninhalts Adapter
es: Un elemento para el adaptador contenido como data.
it: Un elemento per l'adattatore di salvataggio dati

source: Assign Here
de: Hier zuweisen
es: Asigne aquí
it: Assegna

source: Assign Workflow Here
de: Hier einen Arbeitsablauf zuweisen
es: Asigne flujo de trabajo aquí
it: Nuovo workflow

source: Is Image
de: Ist Bild
es: Es imagen
it: Tratta come immagine

source: Only to be used for d2c generated types
de: Nur zur Verwendung mit von d2c erzeugten Artikeltypen
es: Solamente sera usado por tipos de contenidos d2c generados
it: Da usare solo per tipi di contenuto generati con d2c

source: Please enter a name for the type.
de: Bitte geben sie einen Namen für den Artikeltyp ein
es: Por favor, ingrese un nombre para el tipo.
it: Prego, inserisci un nome per il nuovo tipo.

source: PloneFormGen Save Data to Content (d2c)
es: PloneFormGen Guardar Data a Contenido (d2c)
it: PloneFormGen Salva Dati su Contenuto (d2c)

source: Save Data to Content Adapter
de: Daten als Inhalte speichern Adapter
es: Adaptador Guardar Data a Contenido
it: Adattatore Salva Dati su Contenuto

source: Save Data to Content Entry
de: Als Inhalt gespeicherte Daten
es: Elemento Guardar Data a Contenido
it: Elemento del Salva Dati su Contenuto

source: confirm-deletion
de: Sind sie sicher, dass sie diesen Artikeltp löschen möchten? Wenn Objekte von diesem Typ weiter existieren kann es zu Komplikationen kommen.
es: ¿Seguro que quieres borrar este tipo?. ¡Si usted tiene elementos existentes de este tipo, se podría enredar las cosas!
it: Sei sicuro di voler cancellare questo tipo? Se hai ancora contenuti esistenti di questo tipo, questo può creare problemi!

source: help_dynamictitle_text
de: Ein TALES Ausdruck der berechnet wird um den Titel für den Eintrag zu bestimmen
es: Una expresión TALES será evaluada para determinar el título del elemento
it: Un'espressione TALES che verrà valutata per determinare il titolo dell'elemento

source: help_savecontentadapter_avoidsecuritychecks
de: Verhindere eine Prüfung ob der Benutzer über die nötigen Rechte verfügt um die Inhalts Daten zu erstellen. Sie werden werden diese Option in den meisten Fällen angewählt lassen; andernfalls können anonyme Benutzer meistens nicht in der lage sein ein ausgefülltes Formular abzusenden.
es: Evite comprobar si el usuario tiene permiso para crear la data de contenido. Es casi siempre quieren una revisión de esto; De lo contrario, los usuarios anónimos muy probablemente no será capaz de presentar sus formularios.
it: Evita la verifica se l'utente ha i permessi per creare contenuti. Nella maggior parte dei casi vorrai mantenere questo comportamento; in caso contrario gli utenti anonimi non potranno usare il form.

source: help_savecontentadapter_entrytype
de: Artikel Typ, der für die gespeicherten Daten verwendet werden soll. Belassen Sie die Voreinstellung, wenn Sie sich nicht über die Konsequenz im Klaren sind. Wenn Sie einen Plone Standard Typ verwenden, müssen Sie sicher stellen, dass die Felder exakt in der selben Reihenfolge vorliegen, damit die Daten korrekt gespeichert werden können.
es: Tipo de contenido debe usar para los datos guardados. Deja por defecto si no estás seguro de lo que esto hace. Si selecciona un tipo estándar de Plone, usted debe asegurarse que los nombres de campo sean los mismos a fin de que los datos que almacenan correctamente.
it: Tipo di contenuto da usare per i dati salvati. Lascia il default se non sei sicuro di cosa fare qui. Se selezioni un tipo Plone standard, devi essere certo che i nomi dei campi siano nello stesso ordine per memorizzarli correttamente.

source: help_savecontentadapter_niceIds
de: Erzeuge sprechende Kurznamen aus dem Titel-Feld. Wenn dies deaktiviert wird, wird der Kuzname des Objekt aus dem Erstellungsdatum erzeugt. Die Einstellungen für Sicherheitsüberprüfungen von IDs werden berücksichtigt.
es: Generar ids legibles del campo de título. Si esto es desmarcada, el ID de objeto se generará a partir de la fecha de creación. Respeta evitar ajuste los controles de seguridad.
it: Genera id leggibili partendo dal titolo. Se questo è deselezionato gli id dei contenuti saranno generati partendo dalla data di creazione. Rispetta l'impostazione di verifica della sicurezza.

source: help_savecontentadapter_title
de: Wählt ein Feld aus, dass als titel für den Eintrag verwendet werden soll. Sie müssen die bisherigen Formularergebnisse neu indexieren, um die meisten der Änderungen zu übernehmen. Sie können jedes Formular Ergebnis einzeln bearbeiten, um eine Neu-Indexierung zu erzwingen
es: Seleccionar un campo para ser usado como el título de los elementos. Usted tendrá que indexar los resultados del formulario anteriores para que usted note la mayoría de los cambios. Puede editar cada resultado de forma de forzar a indexación.
it: Seleziona un campo che sarà usato come titolo degli elementi generati. Dovrai reindicizzare i contenuti già creati per sentire gli effetti della modifica. Puoi modificare ogni contenuti per forzarne l'indicizzazione.

source: label_dynamictitle_text
de: Dynamisches Überschreiben des Titels
es: Sustitución de título dinámico
it: Sostituizione dinamica del titolo

source: label_savecontentadapter_avoidsecuritychecks
de: Sicherheitsüberprüfungen übergehen
es: Evite Controles de Seguridad
it: Evita i controlli di sicurezza

source: label_savecontentadapter_entrytype
de: Datenspeicherung als Inhalte Artikeltyp
es: Tipo de contenido elemento guardado
it: Tipo di contenuto dei dati salvati

source: label_savecontentadapter_niceIds
de: Sprechende Kurznamen
es: Ids legibles
it: Id leggibili

source: label_savecontentadapter_title
de: Titel Feld
es: Campo Título
it: Campo Titolo

source: title
de: Titel
es: título
